[
  "obsidian-advanced-codeblock",
  "url-into-selection",
  "runjs",
  "select-current-line",
  "obsidian-editor-shortcuts",
  "text-extractor",
  "obsidian-git",
  "quick-latex",
  "simple-embeds",
  "obsidian-image-toolkit",
  "table-editor-obsidian"
]